<details><summary>Digger run report at 2024-03-05 11:54:18 (UTC)</summary>
  <details><summary>Apply for <b>diggerhq/demo-terragrunt-parallel#prod-svc-identity</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.iam_role.aws_iam_policy.example_policy will be created
  + resource "aws_iam_policy" "example_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "s3_bucket_role_identity_prod-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam_role.aws_iam_role.example_role will be created
  + resource "aws_iam_role" "example_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "s3_bucket_role_identity_prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_role.aws_iam_role_policy_attachment.example_attach will be created
  + resource "aws_iam_role_policy_attachment" "example_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "s3_bucket_role_identity_prod"
    }

  # module.s3_bucket.aws_s3_bucket.example_bucket will be created
  + resource "aws_s3_bucket" "example_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "demo-terragrunt-parallel-svc-identity-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_policy.example_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "example_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
module.iam_role.aws_iam_policy.example_policy: Creating...
module.iam_role.aws_iam_role.example_role: Creating...
module.s3_bucket.aws_s3_bucket.example_bucket: Creating...
module.iam_role.aws_iam_policy.example_policy: Creation complete after 1s [id=arn:aws:iam::891377204276:policy/s3_bucket_role_identity_prod-policy]
module.iam_role.aws_iam_role.example_role: Creation complete after 1s [id=s3_bucket_role_identity_prod]
module.iam_role.aws_iam_role_policy_attachment.example_attach: Creating...
module.iam_role.aws_iam_role_policy_attachment.example_attach: Creation complete after 0s [id=s3_bucket_role_identity_prod-20240305115440092600000001]
module.s3_bucket.aws_s3_bucket.example_bucket: Creation complete after 2s [id=demo-terragrunt-parallel-svc-identity-prod]
module.s3_bucket.aws_s3_bucket_policy.example_bucket_policy: Creating...
module.s3_bucket.aws_s3_bucket_policy.example_bucket_policy: Creation complete after 5s [id=demo-terragrunt-parallel-svc-identity-prod]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

  ```
</details>
</details>